frontEnd/new/BudgetBasket/app/controllers/baskets_controller.rb

SELECT "baskets".* FROM "baskets"
---
    def basket
        @baskets = Basket.all

SELECT  "baskets".* FROM "baskets" WHERE "baskets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "baskets" SET "ingredient_organic" = ?, "updated_at" = ? WHERE "baskets"."id" = ?  [["ingredient_organic", 0], ["updated_at", "2019-04-13 17:41:10.071861"], ["id", 4]]
---
    def switchOrganicState
        @basket = Basket.find(params[:basket])
        #if @basket.ingredient_organic == false
            #@basket.ingredient_organic = true
        #else
            #@basket.ingredient_organic = false
        #end
        @basket.ingredient_organic = !@basket.ingredient_organic

        @basket.save