frontEnd/new/BudgetBasket/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def allRecipes
        @recipes = Recipe.all

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1105], ["LIMIT", 1]]
SELECT  1 AS one FROM "baskets" WHERE "baskets"."ingredient_name" = ? LIMIT ?  [["ingredient_name", "ingredient_133"], ["LIMIT", 1]]
SELECT  "baskets".* FROM "baskets" WHERE "baskets"."ingredient_name" = ? LIMIT ?  [["ingredient_name", "ingredient_061"], ["LIMIT", 1]]
SELECT  1 AS one FROM "baskets" WHERE "baskets"."ingredient_name" = ? LIMIT ?  [["ingredient_name", "ingredient_165"], ["LIMIT", 1]]
UPDATE "baskets" SET "ingredient_count" = ?, "updated_at" = ? WHERE "baskets"."id" = ?  [["ingredient_count", 2], ["updated_at", "2019-04-17 16:10:39.455727"], ["id", 6]]
INSERT INTO "baskets" ("ingredient_name", "ingredient_count", "ingredient_organic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ingredient_name", "ingredient_061"], ["ingredient_count", 1], ["ingredient_organic", 0], ["created_at", "2019-04-15 20:09:15.207393"], ["updated_at", "2019-04-15 20:09:15.207393"]]
---
    def addRecipeToBasket
        @recipe = Recipe.find(params[:recipe])

        for ingredient in @recipe.recipe_ingredient_array do
            puts "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
            puts ingredient
            puts Basket.exists?(ingredient_name: ingredient)
            if Basket.exists?(ingredient_name: ingredient)
                @basket = Basket.find_by(ingredient_name: ingredient)
                @basket.ingredient_count = @basket.ingredient_count + 1
                @basket.save
            else
                @basket = Basket.new(:ingredient_name => ingredient, :ingredient_count => 1, :ingredient_organic => false)
                @basket.save